package com.company;

/*
 *  4*. Создайте собственную реализацию интерфейса Map, которая:
 *  Нечетные варианты: при любом способе прохода по ней будет гарантированно выдавать
 *  ключи в том же порядке, в котором они добавлялись в коллекцию;
 *  Четные варианты: при любом способе прохода по ней будет гарантированно выдавать
 *  ключи в отсортированном порядке (правило сортировки задается при создании
 *  коллекции с помощью объекта Comparator), независимо от порядка, в котором они
 *  добавлялись в коллекцию.
 *
 *  Указание: для реализации логики коллекции используйте две структуры данных – хеш-
 *  таблицу и связный список.
 *
 *  Допускается использовать существующие реализации HashMap и LinkedList.
 *  На дополнительный балл – реализуйте структуру данных для хеш-таблицы самостоятельно,
 *  используя линейное либо двойное хеширование.
 *  В этом задании запрещено использовать другие реализации Map (такие как TreeMap и
 *  LinkedHashMap).
 */

public class MyMap {
    // TODO
}
